"""
Створіть програму на Python, яка розраховує суму всіх цілих чисел від 1 до числа, введеного користувачем.

Задачі:

    Запросіть користувача ввести ціле число від 0 до 100. Збережіть це число в змінній num.
    Використовуйте цикл while для підрахунку суми всіх чисел від 1 до введеного числа включно.
    Збережіть результат у змінній sum.

Очікуваний результат:

Програма має вирахувати суму всіх чисел від 1 до num включно і зберегти цю суму в змінній sum.

Підказки:

    Ініціалізуйте змінну sum значенням 0 перед початком циклу.
    В циклі while зменшуйте значення num на 1 після кожного додавання до sum.
    Використовуйте цикл while, який продовжується допоки num більше або дорівнює 0.

Тести:

    При введеному числі 20, очікувана сума в змінній sum має бути 210.
    При введеному числі 10, очікувана сума в змінній sum має бути 55.
    При введеному числі 5, очікувана сума в змінній sum має бути 15.
    При введеному числі 100, очікувана сума в змінній sum має бути 5050.


"""

num = int(input("Enter the integer (0 to 100): "))
# num = 20
sum = 0

i = 1
# while # Ctrl + /
while i <= 20:
    # print(i, sum)
    sum += i # + 1 + 2 + 3 ...
    # print(i, sum)
    i += 1

print(sum)
    


# Comment!